# Brewfile - Homebrew package manager configuration
# Usage: brew bundle install

# ========================================
# Programming Languages & Tools
# ========================================

# Go programming language
brew "go@1.25"

# Sui programming language
brew "sui"

# ========================================
# Development Tools
# ========================================

# Modern text editor
brew "neovim"

# Version control
brew "git"
brew "gh"              # GitHub CLI
brew "lazygit"         # Terminal UI for git
brew "act"             # Run GitHub Actions locally

# Go development tools
brew "delve"           # Go debugger
brew "go-task"         # Task runner

# Database clients
brew "mysql-client"
brew "libpq"

# AI tools
brew "gemini-cli"      # Google Gemini CLI
brew "claude-squad"    # Anthropic Claude CLI

# Cloud tools
brew "awscli"          # AWS command line interface
brew "terraform"
brew "terraform-ls"

# Container management
cask "orbstack"        # Fast Docker Desktop alternative

# Terminal emulator
cask "ghostty"         # Fast, modern terminal

# Productivity
cask "jordanbaird-ice" # Menu bar management

# ========================================
# Modern CLI Tools (Unix replacements)
# ========================================

# Better cat with syntax highlighting
brew "bat"

# Better ls with colors and icons
brew "eza"

# Better grep (fast search)
brew "ripgrep"

# Better find
brew "fd"

# Better top
brew "htop"

# JSON processor
brew "jq"

# Simplified man pages
brew "tldr"

# Fuzzy finder
brew "fzf"

# Smart directory navigation
brew "autojump"

# ========================================
# Fonts (for terminal icons)
# ========================================

cask "font-fira-code-nerd-font"
