# Brewfile - Homebrew package manager configuration
# Usage: brew bundle install

# Custom taps
tap "manaflow-ai/cmux"
tap "tw93/tap"

# ========================================
# Language Runtimes & Bootstrap Tools
# ========================================

# Go programming language
brew "go@1.25"

# Python package and project manager
brew "uv"

# ========================================
# Core Development Tools
# ========================================

brew "neovim"
brew "mole"

brew "git"
brew "git-delta"       # Syntax-highlighting pager for git diff/log
brew "gh"              # GitHub CLI
brew "lazygit"         # Terminal UI for git
brew "act"             # Run GitHub Actions locally
brew "prek"            # pre-commit re-implemented in Rust
brew "delve"           # Go debugger
brew "go-task"         # Task runner

# Language-Adjacent Tooling
brew "marksman"        # Markdown LSP server
brew "bash-language-server" # Bash LSP server
brew "pyright"         # Python LSP server
brew "terraform-ls"

# Infrastructure & Data Tools
brew "awscli"          # AWS CLI
brew "helm"            # Kubernetes package manager
brew "terraform"
brew "grpcurl"         # gRPC command-line tool
brew "protobuf"        # Protocol Buffers compiler/tooling
brew "mysql-client"
brew "libpq"

# GUI Apps
cask "cmux"            # Terminal multiplexer app/CLI
cask "orbstack"        # Fast Docker Desktop alternative
cask "jordanbaird-ice" # Menu bar management
cask "hop"             # HWP document viewer/editor

# ========================================
# Modern CLI Tools (Unix replacements)
# ========================================

# Better cat with syntax highlighting
brew "bat"

# Better ls with colors and icons
brew "eza"

# Better grep (fast search)
brew "ripgrep"

# Better find
brew "fd"

# Better top
brew "htop"

# JSON processor
brew "jq"

# Simplified man pages
brew "tldr"

# Fuzzy finder
brew "fzf"

# Smart directory navigation (faster autojump alternative)
brew "zoxide"

# ========================================
# Fonts (for terminal icons)
# ========================================

cask "font-fira-code-nerd-font"
cask "font-d2coding"
