# Brewfile - Homebrew package manager configuration
# Usage: brew bundle install

# Custom taps
tap "tw93/tap"

# ========================================
# Language Runtimes & Bootstrap Tools
# ========================================

# Go programming language
brew "go@1.25"

# Python package and project manager
brew "uv"

# ========================================
# Core Development Tools
# ========================================

brew "neovim"
brew "mole"
brew "hugo"            # Fast static site generator

brew "git"
brew "git-delta"       # Syntax-highlighting pager for git diff/log
brew "gh"              # GitHub CLI
brew "lazygit"         # Terminal UI for git
brew "act"             # Run GitHub Actions locally
brew "prek"            # pre-commit re-implemented in Rust
brew "delve"           # Go debugger
brew "go-task"         # Task runner

# Language-Adjacent Tooling
brew "gopls"           # Go LSP server
brew "rust-analyzer"   # Rust LSP server
brew "jdtls"           # Java LSP server
brew "kotlin-language-server" # Kotlin LSP server
brew "marksman"        # Markdown LSP server
brew "bash-language-server" # Bash LSP server
brew "pyright"         # Python LSP server
brew "terraform-ls"    # Terraform LSP server
brew "biome"           # JS/TS/JSON/CSS formatter, linter, and LSP helper
brew "yaml-language-server" # YAML LSP server
brew "ruff"            # Python formatter and linter
brew "cargo-nextest"   # Rust test runner
brew "shellcheck"      # Shell script static analysis
brew "shfmt"           # Shell script formatter
brew "yamlfmt"         # YAML formatter

# Infrastructure & Data Tools
brew "awscli"          # AWS CLI
brew "helm"            # Kubernetes package manager
brew "terraform"
brew "grpcurl"         # gRPC command-line tool
brew "protobuf"        # Protocol Buffers compiler/runtime
brew "mysql-client"
brew "libpq"

# GUI Apps
cask "warp"            # Rust-based terminal
cask "orbstack"        # Fast Docker Desktop alternative
cask "jordanbaird-ice" # Menu bar management
cask "hop"             # HWP document viewer/editor

# ========================================
# Modern CLI Tools (Unix replacements)
# ========================================

# Better cat with syntax highlighting
brew "bat"

# Better ls with colors and icons
brew "eza"

# Better grep (fast search)
brew "ripgrep"

# Structural code search and rewrite CLI (`sg`)
brew "ast-grep"

# Better find
brew "fd"

# Better top
brew "htop"

# JSON processor
brew "jq"

# Simplified man pages
brew "tldr"

# Fuzzy finder
brew "fzf"

# Smart directory navigation (faster autojump alternative)
brew "zoxide"

# ========================================
# Fonts (for terminal icons)
# ========================================

cask "font-fira-code-nerd-font"
cask "font-d2coding"
